3rparties/artillery/load-test.yml
config:
  target: http://haproxy
  # For K8S
  # target: https://127.0.0.1:61283
  tls:
    rejectUnauthorized: false
  http:
    timeout: 10
    pool: 4096
    # extendedMetrics: true   
  payload:
    path: 'uuids.csv'
    fields:
      - 'uuid'
    order: random
  phases:
    - name: 'low-load'
      duration: 10m
      arrivalRate: 1000
    - name: 'medium-load'
      duration: 10m
      arrivalRate: 2000
    - name: 'high-load'
      duration: 20m
      arrivalRate: 4000
scenarios:
  - name: '304'
    flow:
    - get:
        url: '/mocks/public/items/public-{{ uuid }}?delay={{ $randomNumber(100,200) }}&cc=public,max-age={{ $randomNumber(1,60) }}'
        headers:
          'Host': 'mocks'
        capture:
          - header: 'last-modified'
            as: 'lastModified'
    - think: '{{ $randomNumber(1,30) }}s'
    - get:
        url: '/mocks/public/items/public-{{ uuid }}?delay={{ $randomNumber(100,200) }}&cc=public,max-age={{ $randomNumber(1,60) }}'
        headers:
          'Host': 'mocks'
          'If-Modified-Since': '{{ lastModified }}'
        ifTrue: 'lastModified'
  - name: 'overflow'
    flow:
    - get:
        url: '/mocks/public/items/public-overflow?delay=500&cc=public,max-age=5'
        headers:
          'Host': 'mocks'