3rparties/artillery/load-test.yml
config:
  payload:
    # path is relative to the location of the test script
    path: 'uuids.csv'
    fields:
      - 'uuid'
  http:
    pool: 2048
    timeout: 10
    keepAlive: true
    cacheDns: true      
  target: http://127.0.0.1
# target: https://127.0.0.1
# tls:
#   rejectUnauthorized: false
  phases:
    - name: 'warmup'
      duration: 1m
      arrivalRate: 500
    - name: 'rampup'
      duration: 1m
      arrivalRate: 1000
    - name: 'load'
      duration: 10m
      arrivalRate: 2000
scenarios:
  - name: '304'
    flow:
    - get:
        url: '/mocks/public/items/public-{{ uuid }}?cc=public,max-age={{ $randomNumber(1,60) }}'
        headers:
          'Host': 'mocks'
        capture:
          - header: 'last-modified'
            as: 'lastModified'
    - think: '{{ $randomNumber(1,30) }}s'
    - get:
        url: '/mocks/public/items/public-{{ uuid }}?cc=public,max-age={{ $randomNumber(1,60) }}'
        headers:
          'Host': 'mocks'
          'If-Modified-Since': '{{ lastModified }}'
        ifTrue: 'lastModified'
  - name: 'overflow'
    flow:
    - get:
        url: '/mocks/public/items/public-overflow?delay=500&cc=public,max-age=5'
        headers:
          'Host': 'mocks'